sizes = {
  #Размеры редуктора
  "shaft_dim":                   (10,  "Диаметр вала"),
  "shaft_thread_dim":            (3,   "Диаметр резьбового отверстие вала, "),
  "shaft_thread_depth":          (3,   "Резьбовое отверстие вала, глубина"),
  "key_length":                  (18,  "Длина шпонки"),
  "key_indent":                  (2,5, "Отступ шпонки от края вала"),
  
  "flange_thread_dim_reducer":   (4,   "Диаметр резьбы на фланце"),
  "flange_thread_D_reducer":     (34,  "Диаметр расположения резьбы на фланце"),
  "flange_thread_depth_reducer": (7,   "Диаметр резьбы на фланце"),
  "flange_collar_dim_reducer":   (26,  "Диаметр бурта на фланце (Посадка h7)"),
  "flange_collar_h_reducer":     (2+1, "Длина бурта на фланце (Посадка h7)"),
  
  #Размеры вала шестерён
  "Диаметр вала шестерни":          (8, "!!!"),
  
  #Размеры шайбы пластины прижима
  "Толщина медной шайбы": (1, "Толщина шайбы между пластиной прижима и несущей пластиной"),
  
  #Размеры пластины прижима
  "Межосевое прижима Вертикаль":    (20, "!!!"),
  "Межосевое прижима Горизонталь":  (20, "!!!"),
  "Диаметр вала крепления":         (8,  "!!!"),
  "Толщина пластины прижима":       (1,  "!!!"),
  "Ширина пластины прижима":        (20, "!!!"),
  
  #Размеры Роликов
  "Внешний диаметр ролика":     (40, "Внешний диаметр ролика"),
  "Внутренний диаметр ролика":  (25, "Внутренний диаметр ролика"),
  "Ширина ролика":              (10, "Ширина ролика"),
  "Диаметр штифтов ролика":     (3,  "Диаметр штифтов ролика"),
  "Пруток_1":                   (0.5,  "Пруток_1"),
  "Пруток_2":                   (1.0,  "Пруток_2")
}