sizes = {
  #Размеры редуктора
  "shaft_dim":                   (10,  "Диаметр вала"),
  "shaft_thread_dim":            (3,   "Диаметр резьбового отверстие вала, "),
  "shaft_thread_depth":          (3,   "Резьбовое отверстие вала, глубина"),
  "key_length":                  (18,  "Длина шпонки"),
  "key_indent":                  (2,5, "Отступ шпонки от края вала"),
  
  "flange_thread_dim_reducer":   (4,   "Диаметр резьбы на фланце"),
  "flange_thread_depth_reducer": (7,   "Диаметр резьбы на фланце"),
  "flange_collar_dim_reducer":   (26,  "Диаметр бурта на фланце (Посадка h7)"),
  "flange_collar_h_reducer":     (2+1, "Длина бурта на фланце (Посадка h7)")
  
  #Размеры энкодера
  
  #Размеры 
  
}